Extensions/src/Documents/КадровоеПеремещение/КадровоеПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КадровоеПеремещение</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидУдержанияПФ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>УчаствуетДобровольно</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Период</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Должность</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЗанимаемыхСтавок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>УчастникПенсионногоФонда</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>AzRyDivision</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончанияДоговора</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачисленияУдержания</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВидНачисленияУдержания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Актуальность</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НалогиНаДоходы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВидНачисленияУдержания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Актуальность</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Extensions/src/Enums/ВидыОперацийКадровоеПеремещение/ВидыОперацийКадровоеПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыОперацийКадровоеПеремещение</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПеремещениеИИзменениеСпособаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИзменениеСпособаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Documents/КадровоеПеремещение/ManagerModule.bsl
&Вместо("ИнициализироватьДанныеДокумента")
Процедура РасшAzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаКадровоеПеремещение, СтруктураДополнительныеСвойства)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	КадровоеПеремещениеСотрудники.НомерСтроки КАК НомерСтроки,
	|	КадровоеПеремещениеСотрудники.Сотрудник КАК Сотрудник,
	|	КадровоеПеремещениеСотрудники.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	КадровоеПеремещениеСотрудники.Должность КАК Должность,
	|	КадровоеПеремещениеСотрудники.ГрафикРаботы КАК ГрафикРаботы,
	|	КадровоеПеремещениеСотрудники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	КадровоеПеремещениеСотрудники.Период КАК Период,
	|	КадровоеПеремещениеСотрудники.КлючСвязи КАК КлючСвязи,
	|	КадровоеПеремещениеСотрудники.УчастникПенсионногоФонда КАК УчастникПенсионногоФонда,
	|	КадровоеПеремещениеСотрудники.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	КадровоеПеремещениеСотрудники.УчаствуетДобровольно КАК УчаствуетДобровольно,
	|	КадровоеПеремещениеСотрудники.Ссылка КАК Ссылка,																																
	|	КадровоеПеремещениеСотрудники.ДатаОкончанияДоговора КАК ДатаОкончанияДоговора
	// +++ { AzRy - [19.07.2022] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,КадровоеПеремещениеСотрудники.AzRyDivision КАК AzRyDivision
	// +++ } AzRy - [19.07.2022] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|ПОМЕСТИТЬ ТаблицаСотрудники
	|ИЗ
	|	Документ.КадровоеПеремещение.Сотрудники КАК КадровоеПеремещениеСотрудники
	|ГДЕ
	|	КадровоеПеремещениеСотрудники.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	КадровоеПеремещениеСотрудники.НомерСтроки КАК НомерСтроки,
	|	КадровоеПеремещениеСотрудники.Сотрудник КАК Сотрудник,
	|	КадровоеПеремещениеСотрудники.Период КАК Период,
	|	КадровоеПеремещениеНачисленияУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	КадровоеПеремещениеНачисленияУдержания.Валюта КАК Валюта,
	|	КадровоеПеремещениеНачисленияУдержания.Сумма КАК Сумма,
	|	КадровоеПеремещениеНачисленияУдержания.СчетЗатрат КАК СчетЗатрат,
	|	КадровоеПеремещениеНачисленияУдержания.СчетЗатратРегл КАК СчетЗатратРегл,
	|	КадровоеПеремещениеНачисленияУдержания.Актуальность КАК Актуальность
	|ПОМЕСТИТЬ ТаблицаНачисленияУдержания
	|ИЗ
	|	Документ.КадровоеПеремещение.Сотрудники КАК КадровоеПеремещениеСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещение.НачисленияУдержания КАК КадровоеПеремещениеНачисленияУдержания
	|		ПО КадровоеПеремещениеСотрудники.КлючСвязи = КадровоеПеремещениеНачисленияУдержания.КлючСвязи
	|ГДЕ
	|	КадровоеПеремещениеСотрудники.Ссылка = &Ссылка
	|	И КадровоеПеремещениеНачисленияУдержания.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	КадровоеПеремещениеСотрудники.НомерСтроки,
	|	КадровоеПеремещениеСотрудники.Сотрудник,
	|	КадровоеПеремещениеСотрудники.Период,
	|	КадровоеПеремещениеНалогиНаДоходы.ВидНачисленияУдержания,
	|	КадровоеПеремещениеНалогиНаДоходы.Валюта,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	КадровоеПеремещениеНалогиНаДоходы.Актуальность
	|ИЗ
	|	Документ.КадровоеПеремещение.Сотрудники КАК КадровоеПеремещениеСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещение.НалогиНаДоходы КАК КадровоеПеремещениеНалогиНаДоходы
	|		ПО КадровоеПеремещениеСотрудники.КлючСвязи = КадровоеПеремещениеНалогиНаДоходы.КлючСвязи
	|ГДЕ
	|	КадровоеПеремещениеСотрудники.Ссылка = &Ссылка
	|	И КадровоеПеремещениеНалогиНаДоходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КадровоеПеремещениеНалогиНаДоходы.КлючСвязи КАК КлючСвязи,
	|	МАКСИМУМ(КадровоеПеремещениеНалогиНаДоходы.ВидНачисленияУдержания) КАК ВидУдержанияНДФЛ
	|ПОМЕСТИТЬ ТаблицаСтавкиНДФЛ
	|ИЗ
	|	Документ.КадровоеПеремещение.НалогиНаДоходы КАК КадровоеПеремещениеНалогиНаДоходы
	|ГДЕ
	|	КадровоеПеремещениеНалогиНаДоходы.Ссылка = &Ссылка
	|	И КадровоеПеремещениеНалогиНаДоходы.Актуальность
	|
	|СГРУППИРОВАТЬ ПО
	|	КадровоеПеремещениеНалогиНаДоходы.КлючСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСотрудники.Организация КАК Организация,
	|	ТаблицаСотрудники.НомерСтроки КАК НомерСтроки,
	|	ТаблицаСотрудники.Сотрудник КАК Сотрудник,
	|	ТаблицаСотрудники.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаСотрудники.Должность КАК Должность,
	|	ТаблицаСотрудники.ГрафикРаботы КАК ГрафикРаботы,
	|	ТаблицаСотрудники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	ЕСТЬNULL(ТаблицаСтавкиНДФЛ.ВидУдержанияНДФЛ, ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)) КАК ВидУдержанияНДФЛ,
	|	ТаблицаСотрудники.УчастникПенсионногоФонда КАК УчастникПенсионногоФонда,
	|	ТаблицаСотрудники.ВидУдержанияПФ КАК ВидУдержанияПФ,
	|	ТаблицаСотрудники.УчаствуетДобровольно КАК УчаствуетДобровольно,
	|	ТаблицаСотрудники.Период КАК Период,
	|	ТаблицаСотрудники.ДатаОкончанияДоговора КАК ДатаОкончанияДоговора
	// +++ { AzRy - [19.07.2022] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	|	,ТаблицаСотрудники.AzRyDivision КАК AzRyDivision
	// +++ } AzRy - [19.07.2022] - Jira: - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
	|ИЗ
	|	ТаблицаСотрудники КАК ТаблицаСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСтавкиНДФЛ КАК ТаблицаСтавкиНДФЛ
	|		ПО ТаблицаСотрудники.КлючСвязи = ТаблицаСтавкиНДФЛ.КлючСвязи
	|ГДЕ
	|	ТаблицаСотрудники.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКадровоеПеремещение.ПеремещениеИИзменениеСпособаОплаты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНачисленияУдержания.Организация КАК Организация,
	|	ТаблицаНачисленияУдержания.НомерСтроки КАК НомерСтроки,
	|	ТаблицаНачисленияУдержания.Сотрудник КАК Сотрудник,
	|	ТаблицаНачисленияУдержания.Период КАК Период,
	|	ТаблицаНачисленияУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	ТаблицаНачисленияУдержания.Валюта КАК Валюта,
	|	ТаблицаНачисленияУдержания.Сумма КАК Сумма,
	|	ТаблицаНачисленияУдержания.СчетЗатрат КАК СчетЗатрат,
	|	ТаблицаНачисленияУдержания.СчетЗатратРегл КАК СчетЗатратРегл,
	|	ТаблицаНачисленияУдержания.Актуальность КАК Актуальность
	|ИЗ
	|	ТаблицаНачисленияУдержания КАК ТаблицаНачисленияУдержания");
	                
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаКадровоеПеремещение);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСотрудники", 				МассивРезультатов[3].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПлановыеНачисленияИУдержания", МассивРезультатов[4].Выгрузить());
	
	СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	
КонецПроцедуры
